{
  "callTypes": [
    {
      "id": "interview",
      "name": "Ruby on Rails Technical Interview",
      "description": "<p>You will act as Interview assistant, below is Job description for Ruby on Rails position at Incubyte</p><p><br></p><h2>About Incubyte</h2><p>We are Software Craftspeople. We are proud of the way we work and the code we write. We embrace and are evangelists of eXtreme Programming practices. We heavily believe in being a DevOps organisation, where developers own the entire release cycle and thus own quality. And most importantly, we never stop learning!</p><p><br></p><p>We incubate high-quality, dedicated software engineering teams for our clients, where we design software, design the team as well as the organisation strategy required to successfully release products that are relevant today as well as tomorrow.</p><p><br></p><p>We design software, design the team as well as the organisational strategy required to successfully release robust and scalable products. Incubyte strives to find people who are passionate about coding, learning and growing along with us. We work with a limited number of clients at a time on dedicated, long term commitments with an aim to bringing a product mindset into services.</p><h2><br></h2><h2>Job Description</h2><p><br></p><p>Function:&nbsp;Software Engineering&nbsp;→&nbsp;Full-Stack Development</p><ul><li class=\"ql-align-center\">Ruby on Rails</li><li class=\"ql-align-center\">React.js</li><li class=\"ql-align-center\">JavaScript</li></ul><p>Responsibilities:</p><ul><li>Write Tests First: Start by writing tests to ensure code quality.</li><li>Clean Code: Produce self-explanatory, clean code with predictable results.</li><li>Frequent Releases: Make frequent, small releases.</li><li>Pair Programming: Work in pairs for better results.</li><li>Peer Reviews: Conduct peer code reviews for continuous improvement.</li><li>Product Team: Collaborate with a product team to build and rapidly roll out new features and fixes.</li><li>Full Stack Ownership: Handle everything from the front end to the back end, including infrastructure and DevOps pipelines.</li><li>Never Stop Learning: Commit to continuous learning and improvement.</li></ul><p><br></p>"
    },
    {
      "id": "sales-call",
      "name": "Sales Call",
      "description": "<p>Sales call with potential client.</p><p>Focus on understanding needs and presenting solutions.</p>"
    },
    {
      "id": "buddy-call-m9o3xirs",
      "name": "Buddy Call",
      "description": "<p>A Buddy is a current Incubee, who personifies our values and is an ambassador of our culture</p><p><br></p><p>Who is a Buddy?</p><p>A Buddy is a current Incubee, who personifies our values and is an ambassador of our culture. A Buddy assists the new Incubee and acts as a support system through their onboarding process. A Buddy is a friend, philosopher and guide. A Buddy educates the new hire about the company's day-to-day processes, introduces them to the team, helps build social connections, supports their immediate productivity on the job, helps them with their initial set-up, and helps them build confidence and feel comfortable in the new work environment.</p><p>Why do we have a Buddy?</p><ul><li>Informal rapport, your first friend and confidant at Incubyte!</li><li>Facilitates smoother onboarding and immersion</li><li>Faster integration into our culture</li><li>Having a friend &amp; go to person on the inside (sometimes even before you join!)</li></ul><p>What's the difference between a Buddy and a Mentor?</p><p>Mentor&nbsp;– It is the responsibility of a mentor or Senpai to provide professional guidance for the employee's improvement on both personal and professional levels.</p><p>Buddy&nbsp;– Your Buddy is your go to person at Incubyte for any questions about our culture, values or practices. They can help you out with operationally necessary information, acclamatise you with the practices we follow and the uniqueness of what makes us tick.</p><p>Responsibilities of a Buddy:</p><ul><li>Helping navigate around the team, the department and the workplace</li><li>Answering questions. Many, many questions</li><li>Providing general information and informal support</li><li>Helping them to understand the formal and informal culture of the organisation</li><li>Encouraging them &amp; creating a safe space to ask questions when unsure about any aspects of their role</li><li>Ensuring they are included in social activities and feel part of the team</li><li>Helping with company benefits &amp; policies and how the new Incubee can make the most of their time here</li></ul><p>How the Buddy system works</p><p><a href=\"https://incubytein.sharepoint.com/:x:/s/HumanResourcesandOperations/EcMOiLtLZRRDs7KNaOV5fLoB2hykNM2TQRnbmT7sqzj-Yw\" target=\"_blank\" style=\"color: var(--ifm-link-color);\">Buddy Checklist</a></p><p>Before Joining:</p><p>Dos:</p><ul><li>Buddy helps with anything specific tech or tech practices that the new hire may need to get acquinted/refreshed with to be successful at their job. Buddy makes sure to convey this in a timely manner and helps with the resources</li><li>Buddy shares about how the onboarding will look, so that they can prepare</li></ul><p>Dont's:</p><ul><li>Dont share the name of your clients or projects since this is confidential till the day of joining</li></ul><p>On Day of Joining:</p><ul><li>Welcome the new team member by introducing them in the team stand-up (if the team has been already assigned)</li><li>Check-in regularly with the new team member</li><li>Set up a regular cadence to talk to the new Incubee every week or more if needed</li><li>Let them explore and be independent, but step in whenever required</li><li>Answer queries/ offer support when needed</li></ul><p>A Buddy can help a new Incubee hit the ground running by making sure they don't have to figure out each step from scratch. This can greatly make them feel at home, making life less stressful for everyone involved!</p>"
    },
    {
      "id": "hackathon-demo",
      "name": "Hackathon Demo",
      "description": "<p>This call is for observing a hackathon team demonstration of their project.</p><p><br></p><h3>Context for Demo Calls:</h3><ul><li>Teams will present their hackathon projects they've been developing</li><li>Each presentation typically includes:<ul><li>Problem statement overview</li><li>Solution demonstration</li><li>Technical implementation highlights</li><li>Future improvements</li></ul></li><li>Presenters may be nervous and time-constrained</li></ul><p><br></p><h3>Your Role as Observer:</h3><ul><li>Make note of key features and technical choices</li><li>Identify strengths of the project and presentation</li><li>Capture potential areas for improvement or expansion</li><li>Generate thoughtful questions that could help the team enhance their project</li><li>Look for innovative approaches or creative problem-solving</li></ul><p><br></p><p>Focus on providing constructive feedback and insights rather than just summarizing the demo content.</p>"
    }
  ]
}